app/controllers/images_controller.rb

	def index
		@images = Image.search(params[:page], params[:type])
---
SELECT * FROM `images` WHERE (image_type = 'logo') ORDER BY created_at DESC LIMIT 0, 20

	def show
		@image = Image.find(params[:id])
---
SELECT * FROM `images` WHERE (`images`.`id` = 0)

	def edit
		@image = Image.find(params[:id])
---
SELECT * FROM `images` WHERE (`images`.`id` = 14)

	def create
		@image = Image.new(params[:image])

		respond_to do |format|
		  if @image.save
---
INSERT INTO `images` (`created_at`, `picture_content_type`, `updated_at`, `picture_file_name`, `picture_updated_at`, `name`, `picture_file_size`, `image_type`) VALUES('2012-03-01 14:03:38', 'image/jpeg', '2012-03-01 14:03:38', 'DSCN5473.JPG', '2012-03-01 14:03:37', 'KArwar', 1247459, 'logo')

	def update
		@image = Image.find(params[:id])

		respond_to do |format|
		  if @image.update_attributes(params[:image])
---
SELECT * FROM `images` WHERE (`images`.`id` = 14)
UPDATE `images` SET `updated_at` = '2012-03-01 14:43:09', `picture_file_size` = 1324053, `picture_updated_at` = '2012-03-01 14:43:07', `picture_file_name` = 'DSCN5496.JPG' WHERE `id` = 14