app/controllers/portfolio_controller.rb

  def logo
	  @images = Image.all(:conditions => ["image_type = 'Logo'"], :order => "created_at DESC")#search_images("Logo", params[:page])
---
SELECT * FROM `images` WHERE (images.id >= 0) AND (image_type = 'logo') ORDER BY images.id ASC LIMIT 4